<template>
  <div class="page-main">
    <h1>Каталог Мессье</h1>
    <div class="page-main__img">
      <img src="@/assets/img/1920px-MessierStarChart.svg.png" alt="Положение объектов на карте звёздного неба">
    </div>
    <div class="page-main__description">
      <p>Каталог Мессье — список из 110 астрономических объектов, составленный французским астрономом Шарлем Мессье и
        впервые изданный в 1774 году. Мессье был охотником за кометами и поставил цель составить каталог неподвижных
        туманностей и звёздных скоплений, которые можно было спутать с кометами[1]. Таким образом, в каталог попали
        разнородные астрономические объекты: галактики, шаровые скопления, эмиссионные туманности, рассеянные скопления,
        планетарные туманности. Истинная природа этих объектов во времена Мессье ещё не была известна. Мессье в своём
        каталоге описывал их просто как туманности (со звёздами или без них) или скопления звёзд.</p>
      <p>Первое издание включало объекты M 1 — M 45. В окончательном виде каталог был создан в 1781 году и опубликован в
        1784 году. Каталог содержал 102 объекта; позже он дополнялся Гершелем некоторыми объектами, которые наблюдались
        Мессье, но по тем или иным причинам не попали в последнее издание каталога. Для многих из этих объектов
        присвоенный Мессье номер до сих пор остаётся основным названием.</p>
      <p>Поскольку Мессье жил во Франции, которая находится в Северном полушарии, в каталог включены только объекты
        севернее 35° южной широты. Такие крупные образования, как Магеллановы облака, остались за рамками списка.</p>
      <p>Хотя ещё при жизни Мессье начали составляться более полные каталоги туманных объектов — в частности, на основе
        наблюдений Уильяма Гершеля был создан Новый общий каталог, содержавший 7840 объектов, — труд Мессье не забыт и в
        настоящее время, так как объекты из его каталога доступны для наблюдения с использованием биноклей и
        любительских
        телескопов. Именно с объектов Мессье многие астрономы-любители начинают знакомство с объектами глубокого
        космоса.</p>
    </div>

  </div>
</template>

<script>
export default {}
</script>

<style lang="scss" scoped>
.page-main {
  box-sizing: border-box;
  padding: 32px;

  h1 {
    margin: 0 0 24px;
  }

  &__img {
    width: 100%;
    border-radius: 20px;

    img {
      border-radius: 20px;
      width: 100%;
      height: auto;
    }
  }
}

</style>